"1 65 1 4206624772 ,"
"input 4 1 3 720 720 0 ,"
" 111 112 113 114 137 138 139 140 163 164 165 166 189 190 191 192 215 216 217 218 241 242 243 244 267 268 269 270 293 294 295 296 319 320 321 322 345 346 347 348 371 372 373 374 397 398 399 400 405 428 429 430 431 436 459 460 461 462 485 85 86 87 88 input output ,"
"output ,"
" 64 ,"
"Pad Pad_13 1 1 input 85 0 0 4 4 4 4 0 0 1 0 ,"
"Convolution Conv_14 1 1 85 86 1 3 32 9 9 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_15 1 1 86 87 32 1e-05 ,"
"ReLU Relu_16 1 1 87 88 ,"
"Pad Pad_30 1 1 88 111 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_31 1 1 111 112 1 32 64 3 3 2 2 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_32 1 1 112 113 64 1e-05 ,"
"ReLU Relu_33 1 1 113 114 ,"
"Pad Pad_47 1 1 114 137 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_48 1 1 137 138 1 64 128 3 3 2 2 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_49 1 1 138 139 128 1e-05 ,"
"ReLU Relu_50 1 1 139 140 ,"
"Pad Pad_64 1 1 140 163 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_65 1 1 163 164 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_66 1 1 164 165 128 1e-05 ,"
"ReLU Relu_67 1 1 165 166 ,"
"Pad Pad_81 1 1 166 189 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_82 1 1 189 190 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_83 1 1 190 191 128 1e-05 ,"
"Add Add_84 2 1 191 140 192 1 ,"
"Pad Pad_98 1 1 192 215 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_99 1 1 215 216 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_100 1 1 216 217 128 1e-05 ,"
"ReLU Relu_101 1 1 217 218 ,"
"Pad Pad_115 1 1 218 241 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_116 1 1 241 242 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_117 1 1 242 243 128 1e-05 ,"
"Add Add_118 2 1 243 192 244 1 ,"
"Pad Pad_132 1 1 244 267 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_133 1 1 267 268 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_134 1 1 268 269 128 1e-05 ,"
"ReLU Relu_135 1 1 269 270 ,"
"Pad Pad_149 1 1 270 293 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_150 1 1 293 294 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_151 1 1 294 295 128 1e-05 ,"
"Add Add_152 2 1 295 244 296 1 ,"
"Pad Pad_166 1 1 296 319 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_167 1 1 319 320 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_168 1 1 320 321 128 1e-05 ,"
"ReLU Relu_169 1 1 321 322 ,"
"Pad Pad_183 1 1 322 345 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_184 1 1 345 346 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_185 1 1 346 347 128 1e-05 ,"
"Add Add_186 2 1 347 296 348 1 ,"
"Pad Pad_200 1 1 348 371 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_201 1 1 371 372 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_202 1 1 372 373 128 1e-05 ,"
"ReLU Relu_203 1 1 373 374 ,"
"Pad Pad_217 1 1 374 397 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_218 1 1 397 398 1 128 128 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_219 1 1 398 399 128 1e-05 ,"
"Add Add_220 2 1 399 348 400 1 ,"
"Upsample Resize_222 1 1 400 405 1 2 2 0 ,"
"Pad Pad_236 1 1 405 428 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_237 1 1 428 429 1 128 64 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_238 1 1 429 430 64 1e-05 ,"
"ReLU Relu_239 1 1 430 431 ,"
"Upsample Resize_241 1 1 431 436 1 2 2 0 ,"
"Pad Pad_255 1 1 436 459 0 0 1 1 1 1 0 0 1 0 ,"
"Convolution Conv_256 1 1 459 460 1 64 32 3 3 1 1 0 0 1 -1 1 1 0 ,"
"InstBatchNormCxx InstanceNormalization_257 1 1 460 461 32 1e-05 ,"
"ReLU Relu_258 1 1 461 462 ,"
"Pad Pad_272 1 1 462 485 0 0 4 4 4 4 0 0 1 0 ,"
"Convolution Conv_273 1 1 485 output 1 32 3 9 9 1 1 0 0 1 -1 1 1 0 ,"
