"1 206 1 4206624772 ,"
"input 4 1 3 1152 1536 0 ,"
" 1015 1020 1025 1028 1052 1057 1062 1065 1089 1094 1099 1125 1130 1135 1138 1162 1167 1172 1175 1199 1204 1209 1220 1233 1234 1237 1250 1251 1254 1267 1268 1271 1284 1285 1304 1305 1306 1307 1308 1309 1310 1319 1323 1324 1325 1326 1327 1335 1336 1355 1356 1357 1358 1359 1360 1361 1370 1374 1375 1376 1377 1378 1386 1387 1393 1400 1403 1406 1409 1412 1415 1418 1421 1424 1427 1430 1433 1436 1439 1442 1445 1448 1451 1454 1457 1460 1463 1466 1469 1472 1475 1478 1481 1484 1487 1490 1493 1496 1499 1502 1505 1508 1511 1514 1517 1520 1523 1526 1529 1532 1535 1538 1541 1544 1547 1550 1553 1556 1559 1562 1565 1568 1571 1574 1577 1580 1583 1586 1589 1592 1595 1598 1601 1604 1607 1610 1613 354 357 360 365 370 394 399 425 430 435 461 466 471 474 498 503 508 534 539 544 547 571 576 581 584 589 594 618 623 649 654 659 685 690 695 698 722 727 732 758 763 768 771 795 800 805 808 832 837 842 868 873 878 881 905 910 915 918 942 947 952 955 979 984 989 input output1 output2 output3 ,"
"output1 output2 output3 ,"
" 205 ,"
"Convolution Conv_0 1 1 input 1400 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_1 1 1 1400 354 ,"
"Convolution Conv_2 1 1 354 1403 1 32 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_3 1 1 1403 357 ,"
"Convolution Conv_4 1 1 357 1406 1 32 64 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_5 1 1 1406 360 ,"
"Upsample Resize_7 1 1 input 365 2 0.5 0.5 1 ,"
"Convolution Conv_8 1 1 365 1409 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_11 1 1 1409 370 ,"
"Pad Pad_26 1 1 370 394 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_27 1 1 394 1412 32 1 32 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_30 1 1 1412 399 ,"
"Convolution Conv_31 1 1 399 1415 1 32 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_46 1 1 1415 425 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_47 1 1 425 1418 1 16 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_50 1 1 1418 430 ,"
"Convolution Conv_51 1 1 430 1421 96 1 96 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_54 1 1 1421 435 ,"
"Convolution Conv_55 1 1 435 1424 1 96 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_70 1 1 1424 461 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_71 1 1 461 1427 1 24 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_74 1 1 1427 466 ,"
"Convolution Conv_75 1 1 466 1430 144 1 144 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_78 1 1 1430 471 ,"
"Convolution Conv_79 1 1 471 1433 1 144 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_80 2 1 1424 1433 474 1 ,"
"Pad Pad_95 1 1 474 498 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_96 1 1 498 1436 1 24 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_99 1 1 1436 503 ,"
"Convolution Conv_100 1 1 503 1439 144 1 144 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_103 1 1 1439 508 ,"
"Convolution Conv_104 1 1 508 1442 1 144 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_119 1 1 1442 534 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_120 1 1 534 1445 1 32 192 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_123 1 1 1445 539 ,"
"Convolution Conv_124 1 1 539 1448 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_127 1 1 1448 544 ,"
"Convolution Conv_128 1 1 544 1451 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_129 2 1 1442 1451 547 1 ,"
"Pad Pad_144 1 1 547 571 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_145 1 1 571 1454 1 32 192 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_148 1 1 1454 576 ,"
"Convolution Conv_149 1 1 576 1457 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_152 1 1 1457 581 ,"
"Convolution Conv_153 1 1 581 1460 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_154 2 1 547 1460 584 1 ,"
"Upsample Resize_156 1 1 input 589 2 0.25 0.25 1 ,"
"Convolution Conv_157 1 1 589 1463 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_160 1 1 1463 594 ,"
"Pad Pad_175 1 1 594 618 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_176 1 1 618 1466 32 1 32 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_179 1 1 1466 623 ,"
"Convolution Conv_180 1 1 623 1469 1 32 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_195 1 1 1469 649 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_196 1 1 649 1472 1 16 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_199 1 1 1472 654 ,"
"Convolution Conv_200 1 1 654 1475 96 1 96 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_203 1 1 1475 659 ,"
"Convolution Conv_204 1 1 659 1478 1 96 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_219 1 1 1478 685 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_220 1 1 685 1481 1 24 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_223 1 1 1481 690 ,"
"Convolution Conv_224 1 1 690 1484 144 1 144 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_227 1 1 1484 695 ,"
"Convolution Conv_228 1 1 695 1487 1 144 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_229 2 1 1478 1487 698 1 ,"
"Pad Pad_244 1 1 698 722 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_245 1 1 722 1490 1 24 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_248 1 1 1490 727 ,"
"Convolution Conv_249 1 1 727 1493 144 1 144 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_252 1 1 1493 732 ,"
"Convolution Conv_253 1 1 732 1496 1 144 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_268 1 1 1496 758 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_269 1 1 758 1499 1 32 192 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_272 1 1 1499 763 ,"
"Convolution Conv_273 1 1 763 1502 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_276 1 1 1502 768 ,"
"Convolution Conv_277 1 1 768 1505 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_278 2 1 1496 1505 771 1 ,"
"Pad Pad_293 1 1 771 795 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_294 1 1 795 1508 1 32 192 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_297 1 1 1508 800 ,"
"Convolution Conv_298 1 1 800 1511 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_301 1 1 1511 805 ,"
"Convolution Conv_302 1 1 805 1514 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_303 2 1 771 1514 808 1 ,"
"Pad Pad_318 1 1 808 832 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_319 1 1 832 1517 1 32 192 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_322 1 1 1517 837 ,"
"Convolution Conv_323 1 1 837 1520 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_326 1 1 1520 842 ,"
"Convolution Conv_327 1 1 842 1523 1 192 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_342 1 1 1523 868 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_343 1 1 868 1526 1 64 384 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_346 1 1 1526 873 ,"
"Convolution Conv_347 1 1 873 1529 384 1 384 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_350 1 1 1529 878 ,"
"Convolution Conv_351 1 1 878 1532 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_352 2 1 1523 1532 881 1 ,"
"Pad Pad_367 1 1 881 905 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_368 1 1 905 1535 1 64 384 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_371 1 1 1535 910 ,"
"Convolution Conv_372 1 1 910 1538 384 1 384 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_375 1 1 1538 915 ,"
"Convolution Conv_376 1 1 915 1541 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_377 2 1 881 1541 918 1 ,"
"Pad Pad_392 1 1 918 942 0 0 1 1 1 1 0 0 0 0 ,"
"Convolution Conv_393 1 1 942 1544 1 64 384 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_396 1 1 1544 947 ,"
"Convolution Conv_397 1 1 947 1547 384 1 384 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_400 1 1 1547 952 ,"
"Convolution Conv_401 1 1 952 1550 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_402 2 1 918 1550 955 1 ,"
"Pad Pad_417 1 1 955 979 0 0 2 2 2 2 0 0 0 0 ,"
"Convolution Conv_418 1 1 979 1553 1 64 384 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_421 1 1 1553 984 ,"
"Convolution Conv_422 1 1 984 1556 384 1 384 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_425 1 1 1556 989 ,"
"Convolution Conv_426 1 1 989 1559 1 384 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_441 1 1 1559 1015 0 0 2 2 2 2 0 0 0 0 ,"
"Convolution Conv_442 1 1 1015 1562 1 96 576 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_445 1 1 1562 1020 ,"
"Convolution Conv_446 1 1 1020 1565 576 1 576 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_449 1 1 1565 1025 ,"
"Convolution Conv_450 1 1 1025 1568 1 576 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_451 2 1 1559 1568 1028 1 ,"
"Pad Pad_466 1 1 1028 1052 0 0 2 2 2 2 0 0 0 0 ,"
"Convolution Conv_467 1 1 1052 1571 1 96 576 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_470 1 1 1571 1057 ,"
"Convolution Conv_471 1 1 1057 1574 576 1 576 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_474 1 1 1574 1062 ,"
"Convolution Conv_475 1 1 1062 1577 1 576 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_476 2 1 1028 1577 1065 1 ,"
"Pad Pad_491 1 1 1065 1089 0 0 2 2 2 2 0 0 0 0 ,"
"Convolution Conv_492 1 1 1089 1580 1 96 576 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_495 1 1 1580 1094 ,"
"Convolution Conv_496 1 1 1094 1583 576 1 576 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_499 1 1 1583 1099 ,"
"Convolution Conv_500 1 1 1099 1586 1 576 160 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pad Pad_515 1 1 1586 1125 0 0 2 2 2 2 0 0 0 0 ,"
"Convolution Conv_516 1 1 1125 1589 1 160 960 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_519 1 1 1589 1130 ,"
"Convolution Conv_520 1 1 1130 1592 960 1 960 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_523 1 1 1592 1135 ,"
"Convolution Conv_524 1 1 1135 1595 1 960 160 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_525 2 1 1586 1595 1138 1 ,"
"Pad Pad_540 1 1 1138 1162 0 0 2 2 2 2 0 0 0 0 ,"
"Convolution Conv_541 1 1 1162 1598 1 160 960 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_544 1 1 1598 1167 ,"
"Convolution Conv_545 1 1 1167 1601 960 1 960 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_548 1 1 1601 1172 ,"
"Convolution Conv_549 1 1 1172 1604 1 960 160 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_550 2 1 1138 1604 1175 1 ,"
"Pad Pad_565 1 1 1175 1199 0 0 4 4 4 4 0 0 0 0 ,"
"Convolution Conv_566 1 1 1199 1607 1 160 960 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_569 1 1 1607 1204 ,"
"Convolution Conv_570 1 1 1204 1610 960 1 960 3 3 1 1 0 0 1 -1 4 4 0 ,"
"ReLU6 Clip_573 1 1 1610 1209 ,"
"Convolution Conv_574 1 1 1209 1613 1 960 320 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pooling AveragePool_583 1 1 1613 1220 1 36 48 36 48 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_596 1 1 1220 1233 2 0 0 1 36 48 ,"
"Add Add_597 2 1 1613 1233 1234 1 ,"
"Pooling AveragePool_600 1 1 1613 1237 1 18 24 18 24 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_613 1 1 1237 1250 2 0 0 1 36 48 ,"
"Add Add_614 2 1 1234 1250 1251 1 ,"
"Pooling AveragePool_617 1 1 1613 1254 1 12 16 12 16 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_630 1 1 1254 1267 2 0 0 1 36 48 ,"
"Add Add_631 2 1 1251 1267 1268 1 ,"
"Pooling AveragePool_634 1 1 1613 1271 1 6 8 6 8 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_647 1 1 1271 1284 2 0 0 1 36 48 ,"
"Add Add_648 2 1 1268 1284 1285 1 ,"
"Upsample Resize_667 1 1 1285 1304 2 0 0 1 72 96 ,"
"Convolution Conv_668 1 1 1304 1305 1 320 128 3 3 1 1 2 2 0 -1 2 2 0 ,"
"Convolution Conv_669 1 1 584 1306 1 32 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Concat Concat_670 2 1 1305 1306 1307 1 ,"
"BatchNormCxx BatchNormalization_671 1 1 1307 1308 ,"
"ReLU Relu_672 1 1 1308 1309 ,"
"Convolution Conv_673 1 1 1309 1310 1 256 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Pooling AveragePool_682 1 1 1310 1319 1 72 96 72 96 0 0 -1 -1 -1 0 0 0 0 ,"
"Reshape Reshape_686 1 1 1319 1323 0 2 2 0 0 0 ,"
"InnerProduct Gemm_687 1 1 1323 1324 16 1 0 1 ,"
"ReLU Relu_688 1 1 1324 1325 ,"
"InnerProduct Gemm_689 1 1 1325 1326 128 1 0 1 ,"
"Sigmoid Sigmoid_690 1 1 1326 1327 ,"
"Reshape Reshape_694 1 1 1327 1335 0 4 4 0 0 1 1 0 ,"
"Mul Mul_695 2 1 1310 1335 1336 1 ,"
"Upsample Resize_714 1 1 1336 1355 2 0 0 1 144 192 ,"
"Convolution Conv_715 1 1 1355 1356 1 128 128 3 3 1 1 2 2 0 -1 2 2 0 ,"
"Convolution Conv_716 1 1 360 1357 1 64 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Concat Concat_717 2 1 1356 1357 1358 1 ,"
"BatchNormCxx BatchNormalization_718 1 1 1358 1359 ,"
"ReLU Relu_719 1 1 1359 1360 ,"
"Convolution Conv_720 1 1 1360 1361 1 256 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Pooling AveragePool_729 1 1 1361 1370 1 144 192 144 192 0 0 -1 -1 -1 0 0 0 0 ,"
"Reshape Reshape_733 1 1 1370 1374 0 2 2 0 0 0 ,"
"InnerProduct Gemm_734 1 1 1374 1375 16 1 0 1 ,"
"ReLU Relu_735 1 1 1375 1376 ,"
"InnerProduct Gemm_736 1 1 1376 1377 128 1 0 1 ,"
"Sigmoid Sigmoid_737 1 1 1377 1378 ,"
"Reshape Reshape_741 1 1 1378 1386 0 4 4 0 0 1 1 0 ,"
"Mul Mul_742 2 1 1361 1386 1387 1 ,"
"Convolution Conv_743 1 1 1356 output3 1 128 2 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Upsample Resize_745 1 1 1387 1393 2 2 2 1 ,"
"Convolution Conv_746 1 1 1393 output2 1 128 2 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Upsample Resize_748 1 1 output2 output1 2 4 4 1 ,"
