"1 189 1 4206624772 ,"
"input 4 1 3 480 640 0 ,"
" 1020 1025 1028 1057 1062 1065 1094 1099 1130 1135 1138 1167 1172 1175 1204 1209 1220 1233 1234 1237 1250 1251 1254 1267 1268 1271 1284 1285 1304 1305 1306 1307 1308 1309 1310 1319 1323 1324 1325 1326 1327 1335 1336 1355 1356 1357 1358 1359 1360 1361 1370 1374 1375 1376 1377 1378 1386 1387 1392 1393 1398 1399 1400 1401 1403 1406 1408 1411 1414 1417 1420 1423 1426 1429 1432 1435 1438 1441 1444 1447 1450 1453 1456 1459 1462 1465 1468 1471 1474 1477 1480 1483 1486 1489 1492 1495 1498 1501 1504 1507 1510 1513 1516 1519 1522 1525 1528 1531 1534 1537 1540 1543 1546 1549 1552 1555 1558 1561 1564 1567 1570 1573 1576 1579 1582 1585 1588 1591 1594 1597 1600 1603 1606 1609 1612 1615 1618 1621 354 357 360 365 370 399 430 435 466 471 474 503 508 539 544 547 576 581 584 589 594 623 654 659 690 695 698 727 732 763 768 771 800 805 808 837 842 873 878 881 910 915 918 947 952 955 984 989 background foreground input ,"
"background foreground ,"
" 188 ,"
"Convolution Conv_0 1 1 input 1408 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_1 1 1 1408 354 ,"
"Convolution Conv_2 1 1 354 1411 1 32 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_3 1 1 1411 357 ,"
"Convolution Conv_4 1 1 357 1414 1 32 64 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_5 1 1 1414 360 ,"
"Upsample Resize_7 1 1 input 365 2 0.5 0.5 1 ,"
"Convolution Conv_8 1 1 365 1417 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_11 1 1 1417 370 ,"
"Convolution Conv_27 1 1 370 1420 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_30 1 1 1420 399 ,"
"Convolution Conv_31 1 1 399 1423 1 32 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_47 1 1 1423 1426 1 16 96 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_50 1 1 1426 430 ,"
"Convolution Conv_51 1 1 430 1429 96 1 96 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_54 1 1 1429 435 ,"
"Convolution Conv_55 1 1 435 1432 1 96 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_71 1 1 1432 1435 1 24 144 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_74 1 1 1435 466 ,"
"Convolution Conv_75 1 1 466 1438 144 1 144 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_78 1 1 1438 471 ,"
"Convolution Conv_79 1 1 471 1441 1 144 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_80 2 1 1432 1441 474 1 ,"
"Convolution Conv_96 1 1 474 1444 1 24 144 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_99 1 1 1444 503 ,"
"Convolution Conv_100 1 1 503 1447 144 1 144 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_103 1 1 1447 508 ,"
"Convolution Conv_104 1 1 508 1450 1 144 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_120 1 1 1450 1453 1 32 192 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_123 1 1 1453 539 ,"
"Convolution Conv_124 1 1 539 1456 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_127 1 1 1456 544 ,"
"Convolution Conv_128 1 1 544 1459 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_129 2 1 1450 1459 547 1 ,"
"Convolution Conv_145 1 1 547 1462 1 32 192 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_148 1 1 1462 576 ,"
"Convolution Conv_149 1 1 576 1465 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_152 1 1 1465 581 ,"
"Convolution Conv_153 1 1 581 1468 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_154 2 1 547 1468 584 1 ,"
"Upsample Resize_156 1 1 input 589 2 0.25 0.25 1 ,"
"Convolution Conv_157 1 1 589 1471 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_160 1 1 1471 594 ,"
"Convolution Conv_176 1 1 594 1474 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_179 1 1 1474 623 ,"
"Convolution Conv_180 1 1 623 1477 1 32 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_196 1 1 1477 1480 1 16 96 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_199 1 1 1480 654 ,"
"Convolution Conv_200 1 1 654 1483 96 1 96 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_203 1 1 1483 659 ,"
"Convolution Conv_204 1 1 659 1486 1 96 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_220 1 1 1486 1489 1 24 144 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_223 1 1 1489 690 ,"
"Convolution Conv_224 1 1 690 1492 144 1 144 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_227 1 1 1492 695 ,"
"Convolution Conv_228 1 1 695 1495 1 144 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_229 2 1 1486 1495 698 1 ,"
"Convolution Conv_245 1 1 698 1498 1 24 144 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_248 1 1 1498 727 ,"
"Convolution Conv_249 1 1 727 1501 144 1 144 3 3 2 2 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_252 1 1 1501 732 ,"
"Convolution Conv_253 1 1 732 1504 1 144 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_269 1 1 1504 1507 1 32 192 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_272 1 1 1507 763 ,"
"Convolution Conv_273 1 1 763 1510 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_276 1 1 1510 768 ,"
"Convolution Conv_277 1 1 768 1513 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_278 2 1 1504 1513 771 1 ,"
"Convolution Conv_294 1 1 771 1516 1 32 192 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_297 1 1 1516 800 ,"
"Convolution Conv_298 1 1 800 1519 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_301 1 1 1519 805 ,"
"Convolution Conv_302 1 1 805 1522 1 192 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_303 2 1 771 1522 808 1 ,"
"Convolution Conv_319 1 1 808 1525 1 32 192 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_322 1 1 1525 837 ,"
"Convolution Conv_323 1 1 837 1528 192 1 192 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_326 1 1 1528 842 ,"
"Convolution Conv_327 1 1 842 1531 1 192 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_343 1 1 1531 1534 1 64 384 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_346 1 1 1534 873 ,"
"Convolution Conv_347 1 1 873 1537 384 1 384 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_350 1 1 1537 878 ,"
"Convolution Conv_351 1 1 878 1540 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_352 2 1 1531 1540 881 1 ,"
"Convolution Conv_368 1 1 881 1543 1 64 384 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_371 1 1 1543 910 ,"
"Convolution Conv_372 1 1 910 1546 384 1 384 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_375 1 1 1546 915 ,"
"Convolution Conv_376 1 1 915 1549 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_377 2 1 881 1549 918 1 ,"
"Convolution Conv_393 1 1 918 1552 1 64 384 1 1 1 1 1 1 1 -1 1 1 0 ,"
"ReLU6 Clip_396 1 1 1552 947 ,"
"Convolution Conv_397 1 1 947 1555 384 1 384 3 3 1 1 0 0 1 -1 1 1 0 ,"
"ReLU6 Clip_400 1 1 1555 952 ,"
"Convolution Conv_401 1 1 952 1558 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_402 2 1 918 1558 955 1 ,"
"Convolution Conv_418 1 1 955 1561 1 64 384 1 1 1 1 2 2 1 -1 1 1 0 ,"
"ReLU6 Clip_421 1 1 1561 984 ,"
"Convolution Conv_422 1 1 984 1564 384 1 384 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_425 1 1 1564 989 ,"
"Convolution Conv_426 1 1 989 1567 1 384 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_442 1 1 1567 1570 1 96 576 1 1 1 1 2 2 1 -1 1 1 0 ,"
"ReLU6 Clip_445 1 1 1570 1020 ,"
"Convolution Conv_446 1 1 1020 1573 576 1 576 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_449 1 1 1573 1025 ,"
"Convolution Conv_450 1 1 1025 1576 1 576 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_451 2 1 1567 1576 1028 1 ,"
"Convolution Conv_467 1 1 1028 1579 1 96 576 1 1 1 1 2 2 1 -1 1 1 0 ,"
"ReLU6 Clip_470 1 1 1579 1057 ,"
"Convolution Conv_471 1 1 1057 1582 576 1 576 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_474 1 1 1582 1062 ,"
"Convolution Conv_475 1 1 1062 1585 1 576 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_476 2 1 1028 1585 1065 1 ,"
"Convolution Conv_492 1 1 1065 1588 1 96 576 1 1 1 1 2 2 1 -1 1 1 0 ,"
"ReLU6 Clip_495 1 1 1588 1094 ,"
"Convolution Conv_496 1 1 1094 1591 576 1 576 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_499 1 1 1591 1099 ,"
"Convolution Conv_500 1 1 1099 1594 1 576 160 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_516 1 1 1594 1597 1 160 960 1 1 1 1 2 2 1 -1 1 1 0 ,"
"ReLU6 Clip_519 1 1 1597 1130 ,"
"Convolution Conv_520 1 1 1130 1600 960 1 960 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_523 1 1 1600 1135 ,"
"Convolution Conv_524 1 1 1135 1603 1 960 160 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_525 2 1 1594 1603 1138 1 ,"
"Convolution Conv_541 1 1 1138 1606 1 160 960 1 1 1 1 2 2 1 -1 1 1 0 ,"
"ReLU6 Clip_544 1 1 1606 1167 ,"
"Convolution Conv_545 1 1 1167 1609 960 1 960 3 3 1 1 0 0 1 -1 2 2 0 ,"
"ReLU6 Clip_548 1 1 1609 1172 ,"
"Convolution Conv_549 1 1 1172 1612 1 960 160 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_550 2 1 1138 1612 1175 1 ,"
"Convolution Conv_566 1 1 1175 1615 1 160 960 1 1 1 1 4 4 1 -1 1 1 0 ,"
"ReLU6 Clip_569 1 1 1615 1204 ,"
"Convolution Conv_570 1 1 1204 1618 960 1 960 3 3 1 1 0 0 1 -1 4 4 0 ,"
"ReLU6 Clip_573 1 1 1618 1209 ,"
"Convolution Conv_574 1 1 1209 1621 1 960 320 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Pooling AveragePool_583 1 1 1621 1220 1 15 20 15 20 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_596 1 1 1220 1233 2 0 0 1 15 20 ,"
"Add Add_597 2 1 1621 1233 1234 1 ,"
"Pooling AveragePool_600 1 1 1621 1237 1 8 10 7 10 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_613 1 1 1237 1250 2 0 0 1 15 20 ,"
"Add Add_614 2 1 1234 1250 1251 1 ,"
"Pooling AveragePool_617 1 1 1621 1254 1 5 8 5 6 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_630 1 1 1254 1267 2 0 0 1 15 20 ,"
"Add Add_631 2 1 1251 1267 1268 1 ,"
"Pooling AveragePool_634 1 1 1621 1271 1 5 5 2 3 0 0 -1 -1 -1 0 0 0 0 ,"
"Upsample Resize_647 1 1 1271 1284 2 0 0 1 15 20 ,"
"Add Add_648 2 1 1268 1284 1285 1 ,"
"Upsample Resize_667 1 1 1285 1304 2 0 0 1 30 40 ,"
"Convolution Conv_668 1 1 1304 1305 1 320 128 3 3 1 1 2 2 0 -1 2 2 0 ,"
"Convolution Conv_669 1 1 584 1306 1 32 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Concat Concat_670 2 1 1305 1306 1307 1 ,"
"BatchNormCxx BatchNormalization_671 1 1 1307 1308 ,"
"ReLU Relu_672 1 1 1308 1309 ,"
"Convolution Conv_673 1 1 1309 1310 1 256 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Pooling AveragePool_682 1 1 1310 1319 1 30 40 30 40 0 0 -1 -1 -1 0 0 0 0 ,"
"Reshape Reshape_686 1 1 1319 1323 0 2 2 0 0 0 ,"
"InnerProduct Gemm_687 1 1 1323 1324 16 1 0 1 ,"
"ReLU Relu_688 1 1 1324 1325 ,"
"InnerProduct Gemm_689 1 1 1325 1326 128 1 0 1 ,"
"Sigmoid Sigmoid_690 1 1 1326 1327 ,"
"Reshape Reshape_694 1 1 1327 1335 0 4 4 0 0 1 1 0 ,"
"Mul Mul_695 2 1 1310 1335 1336 1 ,"
"Upsample Resize_714 1 1 1336 1355 2 0 0 1 60 80 ,"
"Convolution Conv_715 1 1 1355 1356 1 128 128 3 3 1 1 2 2 0 -1 2 2 0 ,"
"Convolution Conv_716 1 1 360 1357 1 64 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Concat Concat_717 2 1 1356 1357 1358 1 ,"
"BatchNormCxx BatchNormalization_718 1 1 1358 1359 ,"
"ReLU Relu_719 1 1 1359 1360 ,"
"Convolution Conv_720 1 1 1360 1361 1 256 128 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Pooling AveragePool_729 1 1 1361 1370 1 60 80 60 80 0 0 -1 -1 -1 0 0 0 0 ,"
"Reshape Reshape_733 1 1 1370 1374 0 2 2 0 0 0 ,"
"InnerProduct Gemm_734 1 1 1374 1375 16 1 0 1 ,"
"ReLU Relu_735 1 1 1375 1376 ,"
"InnerProduct Gemm_736 1 1 1376 1377 128 1 0 1 ,"
"Sigmoid Sigmoid_737 1 1 1377 1378 ,"
"Reshape Reshape_741 1 1 1378 1386 0 4 4 0 0 1 1 0 ,"
"Mul Mul_742 2 1 1361 1386 1387 1 ,"
"Upsample Resize_744 1 1 1387 1392 2 2 2 1 ,"
"Convolution Conv_745 1 1 1392 1393 1 128 2 1 1 1 1 0 0 0 -1 1 1 0 ,"
"Upsample Resize_747 1 1 1393 1398 2 4 4 1 ,"
"Permute Transpose_748 1 1 1398 1399 4 0 3 2 1 ,"
"SoftmaxCaffe Softmax_749 1 1 1399 1400 3 ,"
"Permute Transpose_750 1 1 1400 1401 4 0 3 2 1 ,"
"Gather Gather_752 1 1 1401 1403 1 0 1 ,"
"Unsqueeze Unsqueeze_753 1 1 1403 background 1 1 ,"
"Gather Gather_755 1 1 1401 1406 1 0 1 ,"
"Unsqueeze Unsqueeze_756 1 1 1406 foreground 1 1 ,"
